In [3]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.3'

In [4]:
speeds = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)

speeds

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [5]:
grouped = speeds.groupby("class")

In [6]:
grouped = speeds.groupby(["class", "order"])

In [7]:
df = pd. DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df

     A      B         C         D
0  foo    one -0.531202  0.313275
1  bar    one  0.469327  0.958019
2  foo    two -0.266596  0.378297
3  bar  three -0.431664  0.831780
4  foo    two -0.157646  1.143889
5  bar    two -0.170936  0.364578
6  foo    one -0.942317  0.215073
7  foo  three  0.412481 -1.121931

In [8]:
grouped = df.groupby("A")
grouped = df.groupby("B")
grouped = df.groupby(["A", "B"])

In [9]:
df2 = df.set_index(["A", "B"])
grouped = df2.groupby(level=df2.index.names.difference(["B"]))
grouped.sum()

            C         D
A
bar -0.133273  2.154377
foo -1.485281  0.928603

In [10]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'

In [11]:
grouped =df.T.groupby(get_letter_type)

In [12]:
index = [1, 2, 3, 1, 2, 3]

In [13]:
s = pd.Series([1, 2, 3, 10, 20, 30], index=index)
s

1     1
2     2
3     3
1    10
2    20
3    30
dtype: int64

In [20]:
grouped = s.groupby(level=0)

In [21]:
grouped.first()

1    1
2    2
3    3
dtype: int64

In [22]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [23]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [30]:
df2 = pd.DataFrame({"X": ["B", "B", "A", "A"], "Y": [1, 2, 3, 4]})

In [31]:
df2.groupby(["X"]).sum()

   Y
X
A  7
B  3

In [32]:
df3 = pd.DataFrame({"X": ["A", "B", "A", "B"], "Y" : [1, 4, 3, 2]})

In [33]:
df3.groupby("X").get_group("A")

   X  Y
0  A  1
2  A  3

In [35]:
df3.groupby("X").get_group(("B"))

   X  Y
1  B  4
3  B  2

In [36]:
df_list = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]

In [37]:
df_dropna = pd.DataFrame(df_list, columns=["a", "b", "c"])
df_dropna

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [38]:
df_dropna.groupby(by=["b"], dropna=True).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [40]:
df_dropna.groupby(by=["b"], dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [41]:
df.groupby("A").groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [42]:
df.T.groupby(get_letter_type).groups

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

In [43]:
grouped =df.groupby(["A", "B"])

In [44]:
grouped.groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

In [45]:
len(grouped)

6

In [46]:
n = 10

In [55]:
weight = np.random.normal(166, 20, size=n)

In [56]:
height = np.random.normal(60, 10, size=n)

In [57]:
time = pd.date_range("1/1/2000", periods=n)

In [58]:
gender = np.random.choice(["male", "female"], size=n)

In [59]:
df = pd.DataFrame(
    {"height" : height, "weight" : weight, "gender" : gender}, index=time
)
df

               height      weight  gender
2000-01-01  43.712874  158.140700  female
2000-01-02  63.536497  150.632526  female
2000-01-03  74.264595  174.010586    male
2000-01-04  54.611394  154.568874    male
2000-01-05  52.819827  184.652718  female
2000-01-06  66.803436  186.059632  female
2000-01-07  57.456792  215.326219  female
2000-01-08  72.310680  161.375049    male
2000-01-09  62.241895  150.390136  female
2000-01-10  65.769688  146.493373    male

In [60]:
gb = df.groupby("gender")

In [64]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]

In [66]:
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [67]:
s = pd.Series(np.random.randn(8), index=index)
s

first  second
bar    one      -0.241101
       two       0.035359
baz    one       0.932136
       two       1.049684
foo    one      -0.278732
       two      -0.189793
qux    one      -0.653428
       two       1.101030
dtype: float64

In [68]:
grouped = s.groupby(level=0)

In [69]:
grouped.sum()

first
bar   -0.205742
baz    1.981820
foo   -0.468525
qux    0.447602
dtype: float64

In [70]:
s.groupby(level="second").sum()

second
one   -0.241125
two    1.996280
dtype: float64